const spoilsList = {
  0: { name: '亚拉戈虚构神典石', icon: '', isCertainly: true },
  1: { name: '常风地带上锁的宝箱', icon: 'box', isCertainly: true },
  2: { name: '常风水晶', icon: 'crystal-cf', isCertainly: true },
  3: { name: '常风王子', icon: 'cfwz', isCertainly: false },
  4: { name: '皇帝飞虫的薄翼发饰', icon: 'hdfcdbyfs', isCertainly: false },
  5: { name: '毒蝎格斗服', icon: 'dxgdf', isCertainly: false },
  6: { name: '米斯拉人偶', icon: 'mslro', isCertainly: false },
  7: { name: '阔步高筒靴', icon: 'kbgtx', isCertainly: false },
  8: { name: '迷你法夫纳', icon: 'mnffn', isCertainly: false },
  9: { name: '帕祖祖的羽毛', icon: 'pzzdym', isCertainly: true },
  10: { name: '帕祖祖的祭坛', icon: 'pzzdjt', isCertainly: false },
  11: { name: '恒冰地带上锁的宝箱', icon: 'box', isCertainly: true },
  12: { name: '九宫幻卡：雪童子', icon: 'hk-xtz', isCertainly: false },
  13: { name: '恒冰水晶', icon: 'crystal-hb', isCertainly: true },
  14: { name: '视觉尖角帽', icon: 'sjjjm', isCertainly: true },
  15: { name: '速度腰带', icon: 'sdyd', isCertainly: false },
  16: { name: '贝希摩斯的毛皮', icon: 'bxmsdmp', isCertainly: false },
  17: { name: '贝希摩斯之角', icon: 'bxmszj', isCertainly: false },
  18: { name: '发生变异的结冰上锁宝箱', icon: 'by-box', isCertainly: true },
  19: { name: '凯西耳坠', icon: 'kxez', isCertainly: false },
  20: { name: '娄希的冰片', icon: 'lxdbp', isCertainly: true },
  21: { name: '九宫幻卡：洛希', icon: 'hk-xtz', isCertainly: false },
  22: { name: '涌火地带上锁的宝箱', icon: 'box', isCertainly: true },
  23: { name: '亚拉戈创世神典石', icon: 'cssds', isCertainly: true },
  24: { name: '涌火水晶', icon: 'crystal-yh', isCertainly: true },
  25: { name: '雷姆普里克斯骰子', icon: 'lmplkstz', isCertainly: false },
  26: { name: '阴·阳的皮膜', icon: 'yydpm', isCertainly: false },
  27: { name: '斯库尔的牙', icon: 'skedy', isCertainly: false },
  28: { name: '彭忒西勒亚的火种', icon: 'ptxlydhz', isCertainly: true },
  29: { name: '九宫幻卡：彭忒西勒亚', icon: 'hk-xtz', isCertainly: false },
  30: { name: '丰水水晶', icon: 'crystal-fs', isCertainly: true },
  31: { name: '丰水地带上锁的宝箱', icon: 'box', isCertainly: true },
  32: { name: '未鉴定的封印文理碎晶', icon: 'wjddfywlsj', isCertainly: false },
  33: { name: '摩洛的角', icon: 'mldj', isCertainly: false },
  34: { name: '戈尔德马尔的角', icon: 'gedmedj', isCertainly: false },
  35: { name: '九宫幻卡：矮儒', icon: 'hk-xtz', isCertainly: false },
  36: { name: '刻托的爪子', icon: 'ktdzz', isCertainly: false },
  37: { name: '水晶龙之鳞', icon: 'sjlzl', isCertainly: true },
  38: { name: '九宫幻卡：起源守望者', icon: 'hk-qyswz', isCertainly: false },
  39: { name: '丰水晶簇', icon: 'fsjc', isCertainly: false },
  40: { name: '未鉴定的治愈文理碎晶', icon: 'wjddfywlsj', isCertainly: false },
  41: { name: '未鉴定的守势文理碎晶', icon: 'wjddfywlsj', isCertainly: false },
  42: { name: '未鉴定的妨碍文理碎晶', icon: 'wjddfywlsj', isCertainly: false },
  43: { name: '艾尔凡人偶', icon: 'aefro', isCertainly: false },
  44: { name: '卡尔克', icon: 'kek', isCertainly: false },
}

const NMDescription = {
  0: '循着飘落的花瓣，一朵大花现身了。打倒科里多仙人刺！',
  1: '为了保障族群的安全。章鱼的领袖也亲自出征。打倒常风领主！',
  2: '怪鸟们的呼声唤来了应该已经灭绝的魔物。打倒忒勒斯！',
  3: '在族群面临威胁之际，皇帝御驾亲征，将与来犯之敌血战到底！',
  4: '植物寄生在了死去的熊的尸体上令其活动。打倒卡利斯托！',
  5: '由于妖异主人的死，傀儡也获得了自由。打倒群偶！',
  6: '操控风力的妖精对于领地里的风被搅乱一事十分不满。打倒哲罕南！',
  7: '喜好古代肉食兽的捕食者被血腥味引来。打倒阿米特！',
  8: '妖异鬼魂附在了肉食兽脚类的尸体上。打倒盖因！',
  9: '妖异鬼魂附在了古菩猩猩腐烂的尸体上。打倒庞巴德！',
  10: '统领所有巨钳虾的巨大个体现身了。打倒幻魔蝎塞尔凯特！',
  11: '	大魔界花打算在驱除了妖花的土地上播种。打倒武断魔花茱莉卡！',
  12: '为了帮助苦战的部下，妖异的高阶骑士前来助战。打倒白骑士！',
  13: '独眼巨人为了复仇而现身。打倒波吕斐摩斯！',
  14: '怪鸟由于猎物被抢走而暴怒。打倒阔步西牟鸟！',
  15: '妖异不满于火焰熄灭。打倒极其危险物质！',
  16: '异界之龙的惨叫唤来了龙型妖异的王。打倒狂龙法夫纳！',
  17: '统帅异界魔物的三头魔犬在寻找猎物。打倒阿玛洛克！',
  18: '怨灵们的悲叹唤来了魔王之后。打倒拉玛什图！',
  19: '亡灵们的叹息引来了操纵暴风的大妖异。打倒暴风魔王帕祖祖！',
  20: '因为幸福兔盯上了魔物拥有的挡雪板，却被发现从而惹怒了魔物。打倒夺走幸福的穷奇！',
  21: '因为幸福兔盯上了魔物身上的结晶，却被发现从而惹怒了魔物。打倒愤怒的宝石——宝石角！',
  22: '血液染红了洁白的冰雪，引来了无比愤怒的巨型雪童子。打倒雪之女王！',
  23: '为了寻求消失的禁书与珍惜书籍，书库的看守在不断地徘徊着。打倒塔克西姆！',
  24: '失去部下的大型妖异为了补充战力，正在四处寻找可附身的对象。打倒灰烬龙！',
  25: '感知到同族倒下时的震动，巨大地底生物开始行动了。打倒异形魔虫！',
  26: '雪融化后的积水聚集成了魔法生物。打倒安娜波！',
  27: '增殖后的眼球聚集成了圣兽。献上五行眼打倒白泽，获得最高评价！',
  28: '失去虚伪生命的岩石环绕着冰雪汇集在了一起，再次动了起来。打倒雪屋王！',
  29: '鱼人们的叹息声引来了它们信奉的妖异。打倒阿萨格！',
  30: '逃走后的野生化家畜为了报仇而现身了。打倒苏罗毗！',
  31: '为了回应臣民们求助的声音，王带着骑士们归来了。打倒亚瑟罗王！',
  32: '统帅牛头魔物们并拥有坚固友谊的两兄弟出现了。打倒弥诺陶洛斯兄弟！',
  33: '野牛们不断失去的生命将沉睡中的圣牛唤醒了。打倒优雷卡圣牛！',
  34: '附身在地龙身上的妖异之主在厚厚的云层之下发出咆哮。打倒哈达约什！',
  35: '附身在飞龙身上的妖异之主带着炽热的阳光飞翔而来。打倒荷鲁斯！',
  36: '从魔眼流出的泪水呼唤出了虚无的上位妖异。打倒总领安哥拉·曼纽！',
  37: '从黑衣森林采取到的巨大魔界花种子在极寒的环境下实现了异常的成长。打倒复制魔花凯西！',
  38: '众多尸人兵的嚎叫吸引了异界的妖异骑士。打倒娄希！',
  39: '幸福兔盯上了魔物栖息的珊瑚导致魔物勃然大怒，打倒栖息在珊瑚上的魔物！',
  40: '发现了被魔物关进岩石中的可怜的幸福兔，将其从岩石块中救出，并打倒树木类魔物！',
  41: '以亡灵的抽泣为伴奏，哀伤之歌响彻大地，打倒琉科西亚！',
  42: '被漂浮的电气所吸引，不知从何而来的雷兽显出了身影，打倒佛劳洛斯！',
  43: '受到族人之血的邀请，继承了黑暗知识的妖异出现了，打倒诡辩者！',
  44: '魔法人偶的垂死挣扎呼唤着诅咒的魔法人偶，打倒格拉菲亚卡内！',
  45: '破坏书籍者必遭惩罚，图书管理员乘着灵风飞来，打倒阿斯卡拉福斯！',
  46: '眷属的恸哭呼唤来了妖异贵族，打倒巴钦大公爵！',
  47: '怪鸟数量稀少的土地上，新来的埃托洛斯开始扩张领土，打倒埃托洛斯！',
  48: '毒风的香气引诱熔岩中的魔物现身，打倒来萨特！',
  49: '领地之主凶猛狂暴地狩猎着最爱的熔岩生物，打倒火巨人！',
  50: '丘陵地带被驱赶出去的海燕头领为寻找失去的同伴在空中徘徊，打倒伊丽丝！',
  51: '收到部下发来的救援请求，流浪的佣兵队长现出身影，打倒佣兵雷姆普里克斯！',
  52: '身陷危机的兽人们放出了巨大的雷兽，打倒闪电督军！',
  53: '发现了巨型甲虫樵夫杰科的居所——垂柳树人，打倒所有魔物！',
  54: '斯卡尼特中的长辈看到同族的羽毛漫天飞舞而冲了过来，打倒明眸！',
  55: '无数的魔眼失去了光辉之时，阴阳之间怪异随之出现，打倒阴·阳！',
  56: '黑妖犬咆哮的暴风雪中，凶猛的霜狼显出了身影，打倒斯库尔！',
  57: '随热风翻飞的磷粉聚集于此，美丽而危险的妖异随之出现，打倒彭忒西勒亚！',
  58: '为寻找净水而来到河边的幸福兔被魔物袭击了。打倒凶恶的袭击者！',
  59: '游荡在丰水之地的乌贼型生物头领，为了守护地盘而赶来。打倒卡拉墨鱼！',
  60: '',
  61: '',
  62: '',
  63: '',
  64: '河岸章鱼魔物的血混在一起，散发出的气息吸引了强大的妖异。打倒达佛涅！',
  65: '异界的锻冶王被怨灵们的叹息声所吸引，前来兜售他的商品。打倒戈尔德马尔王！',
  66: '',
  67: '',
  68: '',
  69: '自水晶碎片分散之时，结晶化的龙不知从何处幻化而出，打倒起源守望者！',
  70: '驱使乱灵流包围瓦尔岛并且扰乱地脉稳定的家伙出现了，打倒未确认飞行物体！',
  71: ''
}

/**
 * 战利品类
 */
class Spoils {
  constructor(id, number) {
    this.id = id;
    if (id == 13 || id == 24) {
      // 数量翻倍
      this.number = number * 2;
    } else {
      this.number = number;
    }
    this.isCertainly = spoilsList[id].isCertainly;
    this.name = spoilsList[id].name;
    this.icon = spoilsList[id].icon;
  }
}

/***
 * NM类
 */
class NmObject {
  id = null; // 唯一ID
  level = null; // NM等级
  name = null; // 名称
  description = null; // 描述
  spoils = null; // 掉落
  area = null; // 所属区域
  isRabbit = null; // 是否是幸福兔NM
  place = null; // 刷新地点
  experience = null; // 经验
  light = null; // 光
  trigger = null; // 触发怪
  constructor(
    id, level, name, spoils, area, isRabbit, place, experience, light, trigger
  ) {
    this.id = id;
    this.level = level;
    this.name = name;
    this.description = NMDescription[id];
    this.spoils = new Array();
    for (let i = 0; i < spoils.length; i++) {
      this.spoils.push(new Spoils(...spoils[i].split('|')));
    }
    this.area = area;
    this.isRabbit = isRabbit;
    this.place = place;
    this.experience = experience;
    this.light = light;
    this.trigger = trigger;
    if (trigger) {
      let triggerSlice = /(.*?)\[(\d+)\](\[条件：(.*?)\])?(\[刷新：(.*?)\])?/.exec(trigger);
      this.triggerObj = {
        name: triggerSlice[1],
        level: triggerSlice[2],
        condition: triggerSlice[4],
        conditionMonster: triggerSlice[6]
      };
    }
  }
}

module.exports = {
  anemos: [
    new NmObject(0, 1, '舞动花王——科里多仙人刺', ['23|10', '1|5', '2|3'], 'anemos', false, '13.9,21.9', 2490, 0, '仙人花[6]'),
    new NmObject(1, 2, '章鱼统领——常风领主', ['23|11', '1|6', '2|6', '3|1'], 'anemos', false, '29.7,27.1', 3312, 0, '海祭司[7]'),
    new NmObject(2, 3, '绝命美声——忒勒斯', ['23|12', '1|7', '2|9'], 'anemos', false, '25.6,27.4', 4351, 0, '常风哈佩亚鸟妖[8]'),
    new NmObject(3, 4, '御驾亲征——常风皇帝', ['23|13', '1|8', '2|12', '4|1'], 'anemos', false, '17.2,22.2', 5313, 0, '晏蜓[9]'),
    new NmObject(4, 5, '行尸走肉——卡利斯托', ['23|14', '1|9', '2|15'], 'anemos', false, '25.5,22.3', 6588, 0, '瓦尔巨熊[10]'),
    new NmObject(5, 6, '无主傀儡——群偶', ['23|15', '1|10', '2|18'], 'anemos', false, '23.5,22.7', 7225, 0, '夺灵魔[11]'),
    new NmObject(6, 7, '强风妖精——哲罕南', ['23|16', '1|11', '2|21'], 'anemos', false, '17.7,18.6', 7984, 0, '台风元精[12][条件：强风]'),
    new NmObject(7, 8, '贪食者——阿米特', ['23|17', '1|12', '2|24'], 'anemos', false, '15.0,15.6', 8782, 0, '阿卜拉克萨斯[13]'),
    new NmObject(8, 9, '兽脚怪人——盖因', ['23|18', '1|13', '2|26'], 'anemos', false, '13.8,12.5', 9704, 0, '追踪席兹[14]'),
    new NmObject(9, 10, '腐臭贤者——庞巴德', ['23|20', '1|14', '2|28'], 'anemos', false, '28.3,20.4', 10772, 0, '古老贪吃鬼[15][条件：夜晚]'),
    new NmObject(10, 11, '幻魔蝎——塞尔凯特', ['23|22', '1|15', '2|30', '5|1', '6|1'], 'anemos', false, '24.8,17.9', 11304, 0, '河道巨钳虾[16]'),
    new NmObject(11, 12, '播种者——武断魔花茱莉卡', ['23|24', '1|16', '2|32'], 'anemos', false, '21.9,15.6', 12661, 0, '天仙子[17]'),
    new NmObject(12, 13, '胜利象征——白骑士', ['23|26', '1|17', '2|34'], 'anemos', false, '20.3,13.0', 14244, 0, '黄昏无头骑士[18][条件：夜晚]'),
    new NmObject(13, 14, '巨人的复仇——波吕斐摩斯', ['23|28', '1|18', '2|36'], 'anemos', false, '26.4,14.3', 15089, 0, '独眼怪[19]'),
    new NmObject(14, 15, '狂怒怪鸟——阔步西牟鸟', ['23|30', '1|19', '2|38', '7|1'], 'anemos', false, '28.6,13.0', 17127, 0, '旧世界祖[20]'),
    new NmObject(15, 16, '放火大王——极其危险物质', ['23|32', '1|20', '2|40'], 'anemos', false, '35.3,18.3', 18382, 0, '常风阿那罗[21]'),
    new NmObject(16, 17, '狂乱暗龙——法夫纳', ['23|34', '1|21', '2|43', '8|1'], 'anemos', false, '35.5,21.5', 22059, 0, '龙化石[22][条件：夜晚]'),
    new NmObject(17, 18, '异界魔犬——阿玛洛克', ['23|36', '1|22', '2|46'], 'anemos', false, '7.6,18.2', 26629, 0, '虚无鳞龙[23]'),
    new NmObject(18, 19, '魔王之后——拉玛什图', ['23|38', '1|23', '2|48'], 'anemos', false, '7.7,23.3', 34412, 0, '瓦尔妖影[24][条件：夜晚]'),
    new NmObject(19, 20, '暴风魔王——帕祖祖', ['23|40', '1|25', '2|50', '9|3', '10|1'], 'anemos', false, '7.4,21.7', 37854, 0, '暗影幽灵[25][条件：夜晚][刷新：强风]'),
  ],
  pagos: [
    new NmObject(20, 20, '雪上的幸福兔', ['23|8', '11|1'], 'pagos', true, '18,27', 31545, 0, ''),
    new NmObject(21, 31, '盯上宝石的幸福兔', ['23|10', '11|3'], 'pagos', true, '20,21', 217069, 0, ''),
    new NmObject(22, 20, '纯白的支配者——雪之女王', ['23|10', '11|1', '13|1', '12|1'], 'pagos', false, '21,26', 176753, 0, '雪童子[25]'),
    new NmObject(23, 21, '腐烂的读书家——塔克西姆', ['23|12', '11|2', '13|3'], 'pagos', false, '25,28', 216904, 0, '珍卷恶魔[26][条件：夜晚]'),
    new NmObject(24, 22, '灰壳的鳞王——灰烬龙', ['23|15', '11|2', '13|5'], 'pagos', false, '30,30', 234076, 0, '血魔[27]'),
    new NmObject(25, 23, '地壳变动之谜——异形魔虫', ['23|17', '11|3', '13|6'], 'pagos', false, '33,27', 260995, 0, '瓦尔巨虫[28]'),
    new NmObject(26, 24, '融雪的化身——安娜波', ['23|19', '11|3', '13|7'], 'pagos', false, '32,21', 283962, 0, '融雪元精[29][条件：薄雾]'),
    new NmObject(27, 25, '五行眼的主人——白泽', ['23|21', '11|4', '13|9', '14|1'], 'pagos', false, '28,22', 330732, 0, '啜泣百目妖[30]'),
    new NmObject(28, 26, '移动的雪洞——雪屋王', ['23|23', '11|4', '13|9'], 'pagos', false, '17,16', 350370, 0, '胡瓦西[31]'),
    new NmObject(29, 27, '硬质的病魔——阿萨格', ['23|25', '11|5', '13|10'], 'pagos', false, '10,11', 385619, 0, '徘徊欧浦肯[32]'),
    new NmObject(30, 28, '家畜的慈母——苏罗毗', ['23|27', '11|5', '13|11'], 'pagos', false, '9,19', 425868, 0, '恒冰公山羊[33]'),
    new NmObject(31, 29, '圆桌的雾王——亚瑟罗王', ['23|29', '11|6', '13|12', '15|1'], 'pagos', false, '8,15', 456160, 0, '瓦尔利鳌陆蟹[34][刷新：薄雾]'),
    new NmObject(32, 30, '唇亡齿寒', ['23|31', '11|6', '13|13'], 'pagos', false, '13,19', 506495, 0, '研究所米洛陶洛斯[35]'),
    new NmObject(33, 31, '野牛的救世主——优雷卡圣牛', ['23|33', '11|7', '13|14'], 'pagos', false, '25,17', 564380, 0, '古老水牛[36]'),
    new NmObject(34, 32, '雷云的魔兽——哈达约什', ['23|33', '11|7', '13|15', '16|1', '17|1'], 'pagos', false, '28,17', 620818, 0, '虚无小龙[40][刷新：打雷]'),
    new NmObject(35, 33, '太阳的使者——荷鲁斯', ['23|36', '11|8', '13|16'], 'pagos', false, '25,19', 686004, 0, '虚无薇薇尔飞龙[38][刷新：热浪]'),
    new NmObject(36, 34, '暗眼王——总领安哥拉·曼纽', ['23|37', '11|8', '13|17', '18|1'], 'pagos', false, '23,25', 750569, 0, '瞪视之眼[39]'),
    new NmObject(37, 35, '模仿犯——复制魔花凯西', ['23|40', '11|9', '13|18', '19|1'], 'pagos', false, '22,14', 750569, 0, '阿米雷戴[40][刷新：暴雪]'),
    new NmObject(38, 35, '苍蓝冰刃——娄希', ['23|40', '11|9', '13|20', '20|2', '21|1'], 'pagos', false, '36,19', 750569, 0, '瓦尔腐尸[40][条件：夜晚]'),
  ],
  pyros: [
    new NmObject(39, 35, '瞄准珊瑚的幸福兔', ['23|8', '22|2'], 'pyros', true, '17,27', 344010, 0, ''),
    new NmObject(40, 46, '困入岩石的幸福兔', ['23|10', '22|3'], 'pyros', true, '25,11', 1055871, 0, ''),
    new NmObject(41, 35, '洁白的惨叫——琉科西亚', ['23|12', '22|1', '24|1', '40|1'], 'pyros', false, '26,27', 2408075, 17, '涌火浮灵[39][条件：夜晚]'),
    new NmObject(42, 36, '狰狞的雷兽——佛劳洛斯', ['23|12', '22|2', '24|2', '41|1'], 'pyros', false, '29,29', 2648883, 19, '雷暴元精[41][条件：打雷]'),
    new NmObject(43, 37, '妖异中的辩论家——诡辩者', ['23|15', '22|5', '24|2', '42|1'], 'pyros', false, '32,31', 2917745, 18, '涌火阿班达[42]'),
    new NmObject(44, 38, '恐怖的人偶——格拉菲亚卡内', ['23|17', '22|3', '24|6', '40|1', '44|1'], 'pyros', false, '23,37', 3215355, 19, '瓦尔维京人偶[43]'),
    new NmObject(45, 39, '图书守护者——阿斯卡拉福斯', ['23|19', '22|3', '24|7', '41|1'], 'pyros', false, '18,29', 3544929, 71, '过期魔导书[44][刷新：灵风]'),
    new NmObject(46, 40, '深渊贵族——巴钦大公爵', ['23|21', '22|4', '24|8', '42|1'], 'pyros', false, '17,15', 3910057, 20, '暗黑行吟诗人[45][条件：夜晚]'),
    new NmObject(47, 41, '闪电的指挥者—埃托洛斯', ['23|23', '22|4', '24|9', '40|1'], 'pyros', false, '10,14', 4314747, 21, '瓦尔独爪妖禽[46]'),
    new NmObject(48, 42, '灼热的刺剑——来萨特', ['23|25', '22|5', '24|10', '41|1'], 'pyros', false, '12,11', 4763481, 24, '食鸟者[47]'),
    new NmObject(49, 43, '炎热霸主——火巨人', ['23|27', '22|5', '24|11', '42|1'], 'pyros', false, '15,2', 5261265, 21, '涌火陆蟹[48]'),
    new NmObject(50, 44, '落泪的海燕——伊丽斯', ['23|29', '22|6', '24|12', '40|1'], 'pyros', false, '23,12', 5813698, 23, '北境岩蓝燕[49]'),
    new NmObject(51, 45, '奇迹的生还者——佣兵雷姆普里克斯', ['23|31', '22|6', '24|13', '25|1', '41|1'], 'pyros', false, '21,8', 6243413, 25, '青蓝之手逃亡者[50]'),
    new NmObject(52, 46, '雷兽统领——闪电督军', ['23|33', '22|7', '24|14', '42|1'], 'pyros', false, '26,8', 6968751, 104, '遗弃象魔[51][刷新：打雷]'),
    new NmObject(53, 47, '樵夫杰科的死亡对决', ['23|35', '22|7', '24|15', '40|1', '43|1'], 'pyros', false, '30,10', 7602274, 32, '涌火树精[52]'),
    new NmObject(54, 48, '智慧与战斗之母——明眸', ['23|36', '22|8', '24|16', '41|1'], 'pyros', false, '32,15', 6588637, 25, '瓦尔斯卡尼特[53]'),
    new NmObject(55, 49, '相反的双子——阴·阳', ['23|37', '22|8', '24|17', '26|1', '42|1'], 'pyros', false, '11,34', 9224093, 27, '涌火百目妖[54]'),
    new NmObject(56, 50, '嘲讽的啸狼——斯库尔', ['23|40', '22|9', '24|20', '27|1', '41|1'], 'pyros', false, '24,29', 9224093, 30, '涌火狗灵[55][刷新：暴雪]'),
    new NmObject(57, 50, '炎蝶的女王——彭忒西勒亚', ['23|40', '22|9', '24|20', '28|3', '29|1', '40|1'], 'pyros', false, '35,5', 9224093, 28, '瓦尔血飞蛾[55][刷新：热浪]'),
  ],
  hydatos: [
    new NmObject(58, 50, '戏水的幸福兔', ['23|10', '31|3'], 'hydatos', true, '13,21', 2536625, 0, ''),
    new NmObject(59, 50, '奇怪的乌贼——卡拉墨鱼', ['23|21', '31|4', '30|5', '32|1', '39|1'], 'hydatos', false, '10,25', 11161152, 0, '左米特[55]'),
    new NmObject(60, 51, '暴虐魔兽——剑齿象', ['23|23', '31|4', '30|5', '32|1', '39|1'], 'hydatos', false, '10,17', 12277267, 0, '丰水曙象[56]'),
    new NmObject(61, 52, '流泪的君主——摩洛', ['23|25', '31|5', '30|6', '33|1', '39|1'], 'hydatos', false, '8,21', 13529549, 0, '瓦尔泥口花[57]'),
    new NmObject(62, 53, '惊鸿艳影——皮艾萨耶鸟', ['23|27', '31|5', '30|6', '39|1'], 'hydatos', false, '7,14', 14936622, 0, '多彩恐冠鸟[58]'),
    new NmObject(63, 54, '高傲的猎人——霜鬃猎魔', ['23|29', '31|6', '30|7', '32|1', '39|1'], 'hydatos', false, '8,26', 16519904, 0, '北方猛虎[59]'),
    new NmObject(64, 55, '浴血的妖妃——达佛涅', ['23|31', '31|6', '30|7', '39|1'], 'hydatos', false, '24,19', 18304054, 0, '暗黑虚无鬼鱼[60]'),
    new NmObject(65, 56, '异界的锻冶王——戈尔德马尔王', ['23|33', '31|7', '30|8', '34|1', '39|1', '35|1'], 'hydatos', false, '29,23', 19393977, 0, '丰水幽灵[61][条件：夜晚]'),
    new NmObject(66, 57, '食妖植物——鲁尔克', ['23|35', '31|7', '30|8', '39|1'], 'hydatos', false, '37,26', 0, 0, '虎鹰蜂[62]'),
    new NmObject(67, 58, '业火狮子王——巴隆', ['23|36', '31|8', '30|9', '39|1'], 'hydatos', false, '32,25', 24390235, 0, '研究所雄狮[63]'),
    new NmObject(68, 59, '魔蛇女王——刻托', ['23|38', '31|8', '30|9', '36|1', '39|1'], 'hydatos', false, '36,14', 25699605, 0, '丰水达菲妮[64]'),
    new NmObject(69, 60, '水晶之龙——起源守望者', ['23|40', '31|9', '30|10', '37|3', '38|1'], 'hydatos', false, '32,19', 25699605, 0, '水晶爪[65]'),
    new NmObject(70, 60, '未知的威胁——未确认飞行物体', ['23|40', '31|9', '30|10', '32|1'], 'hydatos', false, '26,29', 25699605, 0, ''),
    new NmObject(71, 60, '巴尔德西昂兵武塔调查支援', ['23|35', '31|7', '30|30'], 'hydatos', false, '18,28', 25699605, 0, ''),
  ]
}